In [10]:
# Let's try to bring in the csv file here

import pandas as pd

# use the existing file name present in the notebook (avoid FileNotFoundError)
df = pd.read_csv("City Rating without Row Numbers.csv")
df

   cities  temp10  temp11  empty_temp  idreesRating  ibrahimRating  melRating
0     NaN      23      32         NaN             5            NaN         -1
1     NaN      29      31         NaN             3            NaN          5
2     NaN      40      50         NaN             3            NaN          4
3     NaN       0      34         NaN             3            NaN          2
4     NaN       5      -2         NaN             3            NaN          3

In [9]:
df2 = pd.read_csv("City Rating without Row Numbers.csv")
df2

   cities  temp10  temp11  empty_temp  idreesRating  ibrahimRating  melRating
0     NaN      23      32         NaN             5            NaN         -1
1     NaN      29      31         NaN             3            NaN          5
2     NaN      40      50         NaN             3            NaN          4
3     NaN       0      34         NaN             3            NaN          2
4     NaN       5      -2         NaN             3            NaN          3

In [8]:
df3 = pd.read_csv("grades.csv")
df3

          Amin  Smith  Kimi  Unnamed: 3
0    maths: 96     95    94         NaN
1  english: 98     95    94         NaN
2  science: 96     95    95         NaN

In [12]:
# Check if 'Unnamed: 0' exists before dropping
if 'Unnamed: 0' in df.columns:
	df = df.drop('Unnamed: 0', axis=1)  # column, axis=1 for column, axis=0 for row
else:
	print("Column 'Unnamed: 0' not found in dataframe")
df

Column 'Unnamed: 0' not found in dataframe

   cities  temp10  temp11  empty_temp  idreesRating  ibrahimRating  melRating
0     NaN      23      32         NaN             5            NaN         -1
1     NaN      29      31         NaN             3            NaN          5
2     NaN      40      50         NaN             3            NaN          4
3     NaN       0      34         NaN             3            NaN          2
4     NaN       5      -2         NaN             3            NaN          3